Комплексная_автоматизация_2_МОМ_2019/src/Enums/ПоказателиОтложенногоНалога/ПоказателиОтложенногоНалога.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПоказателиОтложенногоНалога</name>
  <enumValues>
    <name>ПрибыльДоНалогообложения</name>
  </enumValues>
  <enumValues>
    <name>ОтложенныйНалогНачалоПериода</name>
  </enumValues>
  <enumValues>
    <name>ОтложенныйНалоговыйАктивНачалоПериода</name>
  </enumValues>
  <enumValues>
    <name>ОтложенноеНалоговоеОбязательствоНачалоПериода</name>
  </enumValues>
  <enumValues>
    <name>ОтложенныйНалогКонецПериода</name>
  </enumValues>
  <enumValues>
    <name>ОтложенныйНалоговыйАктивКонецПериода</name>
  </enumValues>
  <enumValues>
    <name>ОтложенноеНалоговоеОбязательствоКонецПериода</name>
  </enumValues>
  <enumValues>
    <name>ОтложенныйНалог</name>
  </enumValues>
  <enumValues>
    <name>ЭффектИзмененияВременныхРазниц</name>
  </enumValues>
  <enumValues>
    <name>ЭффектИзмененияСтавкиТекущегоНалога</name>
  </enumValues>
  <enumValues>
    <name>ЭффектИзмененияСтавкиБудущегоНалога</name>
  </enumValues>
  <enumValues>
    <name>ТекущийНалог</name>
  </enumValues>
  <enumValues>
    <name>РасходПоНалогу</name>
  </enumValues>
  <enumValues>
    <name>ДоходПоНалогу</name>
  </enumValues>
  <enumValues>
    <name>УсловныйРасход</name>
  </enumValues>
  <enumValues>
    <name>УсловныйДоход</name>
  </enumValues>
  <enumValues>
    <name>ПостоянныйНалоговыйРасход</name>
  </enumValues>
  <enumValues>
    <name>ПостоянныйНалоговыйДоход</name>
  </enumValues>
  <enumValues>
    <name>ЧистаяПрибыль</name>
  </enumValues>
  <enumValues>
    <name>ВлияниеУбыткаТекущегоПериода</name>
  </enumValues>
  <enumValues>
    <name>ПостояннаяРазница</name>
  </enumValues>
  <enumValues>
    <name>ВременнаяРазница</name>
  </enumValues>
  <enumValues>
    <name>ОтложенныйРасход</name>
  </enumValues>
  <enumValues>
    <name>ВыбытиеПоСпециальнымРежимам</name>
  </enumValues>
  <enumValues>
    <name>РасчетныйТекущийНалог</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаТекущегоНалога</name>
  </enumValues>
  <enumValues>
    <name>ВлияниеОшибокУчетаРазниц</name>
  </enumValues>
  <enumValues>
    <name>ВлияниеОшибокУчетаОтложенногоНалога</name>
  </enumValues>
</mdclass:Enum>

Комплексная_автоматизация_2_МОМ_2019/src/Enums/ПоказателиОтложенногоНалога/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет код показателя. Нумерация основана на Приложении 1 ПБУ 18.
//
// Параметры:
//  Показатель      - ПеречисленияСсылка.ПоказателиОтложенногоНалога
//  КодыПоказателей - Соответствие - при вызове функции в цикле можно организовать кеш;
//                    Переменную кеша не следует инициализировать до вызова функции (должна иметь значение Неопределено)
// 
// Возвращаемое значение:
//  Строка - код показателя
//
Функция Код(Показатель, КодыПоказателей = Неопределено) Экспорт
	
	Если КодыПоказателей = Неопределено Тогда
		КодыПоказателей = КодыПоказателей();
	КонецЕсли;
	
	Код = КодыПоказателей[Показатель];
	
	Если Код = Неопределено Тогда
		// Показатели без кода используются для сохранения информации, позволяющей найти ошибки в сложных случаях.
		// Они не являются частью регистров бухгалтерского учета.
		Возврат НСтр("");
	Иначе
		Возврат Код;
	КонецЕсли;
	
КонецФункции

// Содержит коды показателей. Нумерация основана на Приложении 1 ПБУ 18.
//
// Возвращаемое значение:
//  Соответствие - коды показателей. Ключ - показатель, Значение - представление.
//
Функция КодыПоказателей() Экспорт
	
	КодыПоказателей = Новый Соответствие;
	
	КодыПоказателей.Вставить(
		ПрибыльДоНалогообложения,
		НСтр("ru = 'А'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		ОтложенныйНалоговыйАктивНачалоПериода,
		НСтр("ru = 'Б'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		ОтложенноеНалоговоеОбязательствоНачалоПериода,
		НСтр("ru = 'В'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		ОтложенныйНалоговыйАктивКонецПериода,
		НСтр("ru = 'Г'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		ОтложенноеНалоговоеОбязательствоКонецПериода,
		НСтр("ru = 'Д'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		ПостояннаяРазница,
		НСтр("ru = 'Е'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		ОтложенныйНалогНачалоПериода,
		НСтр("ru = '1'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		ОтложенныйНалогКонецПериода,
		НСтр("ru = '2'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		ОтложенныйНалог,
		НСтр("ru = '3'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		ЭффектИзмененияВременныхРазниц,
		НСтр("ru = '3А'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		ЭффектИзмененияСтавкиТекущегоНалога,
		НСтр("ru = '3Б'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		ЭффектИзмененияСтавкиБудущегоНалога,
		НСтр("ru = '3В'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		ТекущийНалог,
		НСтр("ru = '4'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		РасходПоНалогу,
		НСтр("ru = '5'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		ДоходПоНалогу,
		НСтр("ru = '5'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		УсловныйРасход,
		НСтр("ru = '6'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		УсловныйДоход,
		НСтр("ru = '6'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		ПостоянныйНалоговыйРасход,
		НСтр("ru = '7'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		ПостоянныйНалоговыйДоход,
		НСтр("ru = '7'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		ЧистаяПрибыль,
		НСтр("ru = '8'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
	Возврат КодыПоказателей;
	
КонецФункции

#КонецОбласти

#КонецЕсли
